Repository: Mostacosta/lari-exchange_
Catalog: lari_site/locale/*/LC_MESSAGES/django.po
Languages: ar

source: About
ar: عن لاري

source: Home
ar: الرئيسية

source: About Lari
ar: عن لاري

source: More
ar: مزيد

source: Message from CEO
ar: رسالة من المدير

source: Mission
ar: المهمة

source: Technology
ar: التكنولوجيا

source: Partners
ar: الشركاء

source: CDM
ar: اماكن المكينات

source: Check Our CDM List
ar: تفقد اماكن المكينات

source: S No
ar: الرقم

source: Branch Name
ar: الفروع

source: Address
ar: العنوان

source: Show Map
ar: عرض الخريطة

source: Branch List
ar: الفروع

source: Check Our Branch List
ar: تفقد الفروع

source: Message from the CEO
ar: رسالة من المدير

source: Schedule of Charges
ar: جدول الرسوم

source: Check Our Schedule of Charges
ar: الاطِّلاع على جدول الرسوم

source: Sl. No.
ar: الرقم

source: Fee(in AED)
ar: السعر بالدرهم

source: Career
ar: الوظيفة

source: Careers
ar: الوظائف

source: Brief about our work
ar: ملخص عن عملنا

source: Apply with basic details
ar: تقدم بطلب بالبيانات الأساسية

source: Apply for the Job
ar: طلب للحصول على وظيفة

source: Please choose an option
ar: يُرجى تحديد خيار

source: Additional applied job details
ar: تفاصيل الوظيفة التي تقدّمت لها الإضافية

source: Your Name
ar: اسمك

source: Gender
ar: الجنس

source: Male
ar: ذكر

source: Female
ar: نثى

source: Date of birth
ar: تاريخ الولادة

source: Nationalty
ar: الجنسية

source: Qualifications
ar: المؤهلات

source: Experience
ar: الخبرة

source: Mobile Number
ar: رقم الهاتف المُتحرك

source: Email Address
ar: البريد الالكتروني

source: Send
ar: ارسال

source: Reach Us
ar: اتصل بنا

source: Download Center
ar: مركز التحميل

source: Our Download Center
ar: مركز التحميل

source: DOWNLOAD
ar: حمل

source: FAQ
ar: سؤال و اجابة

source: Check frequently asked questions
ar: الاسئلة الشائعة

source: PayMax FAQ
ar: بطاقة باي ماكس

source: GCard FAQ
ar: بطاقة الجي

source: Promotions News & Event
ar: الاخبار

source: Check Latest Promotions & News
ar: تفقد اخر الاخبار

source: Read More
ar: مزيد

source: Products
ar: المنتجات

source: Check our latest products
ar: تفقد اخر المنتجات

source: Mission & Vision
ar: المهمة

source: Promotions & News
ar: الاخبار

source: Products & Services
ar: الخدمات و المنتجات

source: Forex
ar: فوركس

source: All Services
ar: كل الخدمات

source: technology
ar: تكنولوجيا

source: Lari Exchange implements the following technologies:
ar: تطبق لاري للصرافة التقنيات التالية
